# 1. Data Operation in Numpy
The most important object defined in NumPy is an N-dimensional array type called ndarray. It describes the collection of items of the same type. Items in the collection can be accessed using a zero-based index. An instance of ndarray class can be constructed by different array creation routines described later in the tutorial. The basic ndarray is created using an array function in NumPy as follows <br>
``` numpy.array ```

example 1:

In [5]:
import numpy as np 
a = np.array([[1, 2], [3, 4]]) 
print(a)

[[1 2]
 [3 4]]

example 2:

In [7]:
import numpy as np 
a = np.array([1, 2, 3], dtype = complex) # dtype parameter
print(a)

[1.+0.j 2.+0.j 3.+0.j]

# 2. Data Operations in Pandas

Pandas handles data through Series,Data Frame, and Panel. We will see some examples from each of these.

## 2.1 Panda Series
Series is a one-dimensional labeled array capable of holding data of any type (integer, string, float, python objects, etc.). The axis labels are collectively called index. A pandas Series can be created using the following constructor − <br>
```pandas.Series( data, index, dtype, copy)```

example 1:

In [9]:
#import the pandas library and aliasing as pd
import pandas as pd
import numpy as np
data = np.array(['a','b','c','d'])
s = pd.Series(data)
print(s)

0    a
1    b
2    c
3    d
dtype: object

## 2.2 Pandas DataFrame
A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns. A pandas DataFrame can be created using the following constructor − <br>
```pandas.DataFrame( data, index, columns, dtype, copy)```

example 1:

In [11]:
import pandas as pd
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}
df = pd.DataFrame(data, index=['rank1','rank2','rank3','rank4'])
print(df)

        Name  Age
rank1    Tom   28
rank2   Jack   34
rank3  Steve   29
rank4  Ricky   42

Struktur DataFrame Pandas:

![DataFrame_structure](img/dataframestructure.png)

## 2.3 Selecting Subset of Data in Pandas

There are many ways to select subsets of data, but e we will only cover the usage of the square brackets ```([])```, ```.loc``` and ```.iloc```. Collectively, they are called the indexers. These are by far the most common ways to select data. A different part of this Series will discuss a few methods that can be used to make subset selections.

If we have a DataFrame, named df, your subset selection will look something like the following: <br>
```df[ ]```<br>
```df.loc[ ]```<br>
```df.iloc[ ]```

```def[]``` use for indexing a column or several columns <br>
example 1:

In [17]:
df

        Name  Age
rank1    Tom   28
rank2   Jack   34
rank3  Steve   29
rank4  Ricky   42

In [18]:
df['Name']

rank1      Tom
rank2     Jack
rank3    Steve
rank4    Ricky
Name: Name, dtype: object

In [19]:
df[['Name', 'Age']]

        Name  Age
rank1    Tom   28
rank2   Jack   34
rank3  Steve   29
rank4  Ricky   42

The ```.loc``` indexer selects data in a different way than just the indexing operator. It can select subsets of rows or columns. It can also simultaneously select subsets of rows and columns. Most importantly, it only selects data by the LABEL of the rows and columns.

example 1:

In [21]:
df.loc['rank1']

Name    Tom
Age      28
Name: rank1, dtype: object

example 2:

In [22]:
df.loc[['rank2', 'rank4']]

        Name  Age
rank2   Jack   34
rank4  Ricky   42

example 3: <br>selecting multiple row with range of row of indexes

In [23]:
df.loc['rank2':'rank4']

        Name  Age
rank2   Jack   34
rank3  Steve   29
rank4  Ricky   42

example 4:

In [25]:
df.loc[:'rank3']

        Name  Age
rank1    Tom   28
rank2   Jack   34
rank3  Steve   29

The ```.iloc``` indexer is very similar to .loc but only uses integer locations to make its selections. The word .iloc itself stands for integer location so that should help with remember what it does.

```df.loc['rank1']``` sama dengan ```df.iloc[0]```

In [26]:
df.iloc[0]

Name    Tom
Age      28
Name: rank1, dtype: object